package com.bbsoft.common.constant;


/**
 * 错误码和提示消息配置类
 * ClassName: MessageConfig 
 * @Description: 应用的错误码和提示消息
 */
public enum MsgeData {
	
	/*** 域名 */
	ATTACHMENT_URL("http://www.qcloud0755.com","http://www.qcloud0755.com"),
	
	/*** 服务器异常 */
	SYSTEM_10100("-10100", "服务器正在维护中，请稍后再试"),
	/*** 签名错误*/
	SYSTEM_10101("-10101", "签名错误"),
	/*** 用户信息会话失效*/
	SYSTEM_10102("-10102", "用户会话信息失效"),
	/*** ID错误*/
	SYSTEM_10103("-10103", "ID错误"),
	/*** 参数错误*/
	SYSTEM_10104("-10104", "参数错误"),
	/*** 信息不存在*/
	SYSTEM_10105("-10105", "信息不存在"),
	/*** 访问接口出错*/
	SYSTEM_10106("-10106", "访问接口出错"),
	/** token已失效，请重新登陆！*/
	SYSTEM_10107("-10107","token已失效，请重新登陆！"),
	/*** 数据转换异常*/
	SYSTEM_10108("10108", "数据转换异常"),
	/** JSON格式错误，请传入正确的参数！*/
	SYSTEM_10109("-10109","JSON格式错误，请传入正确的参数！"),
	/** Excel格式错误,请下载平台提供的模板！*/
	SYSTEM_10110("-10110","Excel格式错误,请下载平台提供的模板！"),
	/** 数据源中没有任何数据！*/
	SYSTEM_10111("-10111","数据源中没有任何数据！"),
	/** 导出Excel失败！*/
	SYSTEM_10112("-10112","导出Excel失败！"),
	/** Excel文件中没有任何数据！*/
	SYSTEM_10113("-10113","Excel文件中没有任何数据！"),
	/** Excel中缺少必要的字段，或字段名称有误！*/
	SYSTEM_10114("-10114","Excel中缺少必要的字段，或字段名称有误！"),
	/** Excel中有重复行，请检查！*/
	SYSTEM_10115("-10115","Excel中有重复行，请检查！"),
	/** 导入Excel失败！*/
	SYSTEM_10116("-10116","导入Excel失败！"),
	/** 至少需要传入两个以上参数（包含两个）！*/
	SYSTEM_10120("-10120","至少需要传入两个以上参数（包含两个）！"),
	/** 操作有误，存在编辑他人信息行为！*/
	SYSTEM_10121("-10121","操作有误，存在编辑他人信息行为！"),
	
	/** 404请求不存在！*/
	SYSTEM_10122("-10122","404请求不存在！"),
	/** 405，方法不被允许！*/
	SYSTEM_10123("-10123","405方法不被允许！"),
	/** 500内部服务器（HTTP-Internal Server Error）错误！*/
	SYSTEM_10124("-10124","500内部服务器（HTTP-Internal Server Error）错误！"),
	/** 微信签名回调code错误！*/
	SYSTEM_10125("-10125","微信签名回调code错误！"),
	/** 微信TOKEN获取失败，请检查是否配置有误！*/
	SYSTEM_10126("-10126","微信TOKEN获取失败，请检查是否配置有误！"),
	/** 调用微信接口错误！*/
	SYSTEM_10127("-10127","调用微信接口错误！"),
	/** 获取用户OPEN_ID失败，请授权！*/
	SYSTEM_10128("-10128","获取用户OPEN_ID失败！"),
	/** 获取地理位置失败！*/
	SYSTEM_10129("-10129","获取地理位置失败！"),
	
	/** 文件路径不存在！*/
	FILE_10200("-10200","文件路径不存在"),
	/** 裁剪文件失败！*/
	FILE_10201("-10201","裁剪文件失败"),
	/** 无法创建文件！*/
	FILE_10202("-10202","无法创建文件！"),
	/** 文件不存在！*/
	FILE_10203("-10203","文件不存在！"),
	/** 文件缩放失败！*/
	FILE_10204("-10204","文件缩放失败！"),
	
	
	/**支付宝错误信息 本地订单不存在*****/
	ALIPAY_00001("-00001","订单不存在"),
	/**支付宝服务器签名验证失败*****/
	ALIPAY_00002("-00002","服务器签名验证失败"),
	/**支付宝服务实例化客户端失败*****/
	ALIPAY_00003("-00003","实例化客户端失败"),
	/**支付宝服务校验通知数据失败*****/
	ALIPAY_00004("-00004","校验通知数据失败"),
	
	/*****************************公共错误编码 1000010001*************************/
	/** 手机号格式错误！*/
	PUBLIC_1000010001("-1000010001","手机号格式错误！"),
	/** 身份证格式错误！*/
	PUBLIC_1000010002("-1000010002","身份证格式错误!"),
	/** 邮箱格式错误！*/
	PUBLIC_1000010003("-1000010003","邮箱格式错误!"),
	/** 验证码已经发送，限制时间之内不允许重复发送！*/
	PUBLIC_1000010004("-1000010004","验证码已经发送，限制时间之内不允许重复发送！"),
	/** 验证码错误，请重新输入！*/
	PUBLIC_1000010005("-1000010005","验证码错误，请重新输入！"),
	/** 上传文件为空，请重新上传！*/
	PUBLIC_1000010006("-1000010006","上传文件为空，请重新上传！"),
	/** 此文件不为图片文件！*/
	PUBLIC_1000010007("-1000010007","此文件不为图片文件！"),
	/** 文件超过10M，请重新上传！*/
	PUBLIC_1000010008("-1000010008","文件过大！"),
	/** 密码错误，请重新输入！*/
	PUBLIC_1000010009("-1000010009","密码错误，请重新输入！"),
	/**账号和密码不能为空！**/
	PUBLIC_1000010010("-1000010010","账号和密码不能为空！"),
	/** 密码不能为空，请输入密码！*/
	PUBLIC_1000010011("-1000010011","密码不能为空，请输入密码！"),
	/** 密码长度不能少于6位数！*/
	PUBLIC_1000010012("-1000010012","密码长度不能少于6位数！"),
	/** 验证码不能为空！*/
	PUBLIC_1000010013("-1000010013","验证码不能为空！"),
	/** 原密码输入不一致！*/
	PUBLIC_1000010014("-1000010014","原密码输入不一致！"),
	/** 两次密码输入不一致！*/
	PUBLIC_1000010015("-1000010015","两次密码输入不一致！"),
	/** 请选择支付方式！*/
	PUBLIC_1000010016("-1000010016","请选择支付方式！"),
	/** 开始时间不能大于结束时间！*/
	PUBLIC_1000010017("-1000010017","开始时间不能大于结束时间！"),
	/** 订单金额不能为小于0！*/
	PUBLIC_1000010018("-1000010018","订单金额不能为小于0！"),
	
	
	/*****************************用户错误编码 1000020001 *************************/
	/** 该用户名已经注册！*/
	USER_1000020001("-1000020001","该用户名已经注册！"),
	/** 该手机号已经被注册！*/
	USER_1000020002("-1000020002","该手机号已经被注册！"),
	/** 用户信息不存在！*/
	USER_1000020003("-1000020003","用户信息不存在！"),
	/** 存在不可以修改的用户信息，如：手机号，账户号！*/
	USER_1000020004("-1000020004","存在不可以修改的用户信息，如：手机号，账户号！"),
	/** 角色名称已经存在！*/
	USER_1000020005("-1000020005","角色名称已经存在！"),
	/** 角色信息不存在！*/
	USER_1000020006("-1000020006","角色信息不存在！"),
	/** 用户已被禁用！*/
	USER_1000020007("-1000020007","用户已被禁用！"),
	/** 一天不能超过十次反馈留言噢！*/
	USER_1000020008("-1000020008","一天不能超过十次反馈留言噢！"),
	/**  反馈信息不存在！*/
	USER_1000020009("-1000020009","反馈信息不存在！"),
	/**  银行卡信息已存在！*/
	USER_1000020010("-1000020010","银行卡信息已存在！"),
	/**  银行卡信息不存在！*/
	USER_1000020011("-1000020011","银行卡信息不存在！"),
	/**  手机号与当前登录用户不一致！*/
	USER_1000020012("-1000020012","手机号与当前登录用户不一致！"),
	/**  您非店铺管理员，不能进行此项操作！*/
	USER_1000020013("-1000020013","您非店铺管理员，不能进行此项操作！"),
	/**  店铺未开始营业，请稍后再试！*/
	USER_1000020014("-1000020014","店铺未开始营业，请稍后再试！"),
	/**  用户未注册，请先注册后再使用！*/
	USER_1000020015("-1000020015","用户未注册，请先注册后再使用！"),
	/**  该用户可提现佣金不足，不能确认提现！*/
	USER_1000020016("-1000020016","该用户可提现佣金不足，不能确认提现！"),
	
	/*****************************业务模块错误编码 1000030001 *************************/
	/** 会员卡号已存在！*/
	CARD_1000030001("-1000030001","会员卡号已存在！"),
	/** 会员卡信息不存在！*/
	CARD_1000030002("-1000030002","会员卡信息不存在！"),
	/** 会员卡信息未配置，请联系客户人员！*/
	CARD_1000030003("-1000030003","会员卡信息未配置，请联系客户人员！"),
	/** 订单信息不存在！*/
	ORDER_1000030004("-1000030004","订单信息不存在！"),
	/** 请选择需要充值的会员卡！*/
	CARD_1000030005("-1000030005","请选择需要充值的会员卡！"),
	/** 充值记录不存在！*/
	CARD_1000030006("-1000030006","充值记录不存在！"),
	/** 可提现佣金不足！*/
	CARD_1000030007("-1000030007","可提现佣金不足！"),
	/** 会员提现记录不存在！*/
	CARD_1000030008("-1000030008","会员提现记录不存在！"),
	/** 您不是该卡持卡人，不允许查看！*/
	CARD_1000030009("-1000030009","您不是该卡持卡人，不允许查看！"),
	/** 您还未绑定会员卡，请先绑定再使用！*/
	CARD_1000030010("-1000030010","您还未绑定会员卡，请先绑定再使用！"),
	/** 商品名称已存在！*/
	CARD_1000030011("-1000030011","商品名称已存在！"),
	/** 商品信息不存在！*/
	CARD_1000030012("-1000030012","商品信息不存在！"),
	/** 会员余额不足，请充值后再使用！*/
	CARD_1000030013("-1000030013","会员余额不足，请充值后再使用！"),
	/** 已领取会员卡，不能再领取！*/
	CARD_1000030014("-1000030014","已领取会员卡，不能再领取！"),
	/** 没有更多卡号可选了！*/
	CARD_1000030015("-1000030015","没有更多卡号可选了！"),
	/** 会员卡未激活，不能使用！*/
	CARD_1000030016("-1000030016","会员卡未激活，不能使用！"),
	/** 您不是该卡持有人，请先购买后再绑定！*/
	CARD_1000030017("-1000030017","您不是该卡持有人，请先购买后再绑定！"),
	/** 您已经购买了会员卡，请勿重复购买！*/
	CARD_1000030018("-1000030018","您已经购买了会员卡，不能再次购买！"),
	/** 您未购买此卡，请购买后再绑定！*/
	CARD_1000030019("-1000030019","您未购买此卡，请购买后再绑定！"),
	/** 您未购买会员卡，请购买后再绑定！*/
	CARD_1000030020("-1000030020","您未购买会员卡，请购买后再绑定！"),
	/** 二维码已失效，请刷新后再使用！*/
	CARD_1000030021("-1000030021","二维码已失效，请刷新后再使用！"),
	/** 会员卡已被使用！*/
	CARD_1000030022("-1000030022","会员卡已被使用！"),
	/** 该用户已存在会员卡！*/
	CARD_1000030023("-1000030023","该用户已存在会员卡！"),
	/** 会员卡已被他们购买，请更换选择！*/
	CARD_1000030024("-1000030024","会员卡已被购买，请更换选择！"),
	
	/*****************************店铺模块错误编码 1000040001 *************************/
	/** 店铺名称已存在！*/
	SHOP_1000040001("-1000040001","店铺名称已存在！"),
	/** 店铺信息不存在！*/
	SHOP_1000040002("-1000040002","店铺信息不存在！"),
	/**此门店记录已经结算过了！*/
	SHOP_1000040003("-1000040003","此门店记录已经结算过了！"),
	/** 此商户暂未提交结算记录！*/
	SHOP_1000040004("-1000040004","此商户暂未提交结算记录！"),
	/** 交易异常，请稍后再试！*/
	SHOP_1000040005("-1000040005","交易异常，请稍后再试！"),
	
	/*****************************微信模块错误编码 1000050001 *************************/
	/** 微菜单子菜单不能多于5个！*/
	WECHAT_1000050001("-1000050001","微菜单子菜单不能多于5个！"),
	/** 微菜单主菜单不能多于3个！*/
	WECHAT_1000050002("-1000050002","微菜单子菜单不能多于3个！"),
	
	;
	private String code;
	private String msg;

	private MsgeData(String code, String msg) {
		this.code = code;
		this.msg = msg;
	}

	public String  getCode() {
		return code;
	}

	public String getMsg() {
		return msg;
	}
	public String getMsgResult(){
		return this.code + "," + this.msg;
	}
	
	public String getMsg(String string) {
		return string != null? msg + ":[" + string + "]" : msg;
	}
}
